Repository: bobbingwide/fizzie
Catalog: languages/fizzie-bb_BB.po
Languages: bb_bb

source: 404.html
bb_bb: 404.hmtl

source: archive-block.html
bb_bb: acrihve-bolck.hmtl

source: archive-oik-plugins.html
bb_bb: acrihve-OIk-puligns.hmtl

source: archive-oik-themes.html
bb_bb: acrihve-OIk-tehems.hmtl

source: archive.html
bb_bb: acrihve.hmtl

source: category.html
bb_bb: ctageroy.hmtl

source: front-page.html
bb_bb: fornt-pgae.hmtl

source: home.html
bb_bb: hmoe.hmtl

source: index.html - you shouldn't have got here!
bb_bb: idnex.hmtl - yOU sohludn't hvae gOt hree!

source: page-13.html for the Sitemap
bb_bb: pgae-13.hmtl fOr thE Stimeap

source: page-about.html 11:49
bb_bb: pgae-aobut.hmtl 11:49

source: page-i18-test.html 12:22
bb_bb: pgae-I18-tset.hmtl 12:22

source: search.html
bb_bb: saecrh.hmtl

source: single-full.html custom template
bb_bb: snilge-flul.hmtl csuotm tmelptae

source: single-oik-plugins.html
bb_bb: snilge-OIk-puligns.hmtl

source: single-oik-themes.html
bb_bb: snilge-OIk-tehems.hmtl

source: single.html
bb_bb: snilge.hmtl

source: singular.html
bb_bb: sniugalr.hmtl

source: Home
bb_bb: Hmoe

source: Blog
bb_bb: Bolg

source: Sitemap
bb_bb: Stimeap

source: Sites
bb_bb: Sties

source: This is an example of the Footer variant of the template part with a single paragraph.
bb_bb: Tihs Is An eaxpmle Of thE Fooetr vraaint Of thE tmelptae prat wtih A snilge pragaarph.

source: [bw_wpadmin]<br>(C) Copyright Bobbing Wide 2020, 2021. All rights reserved
bb_bb: [bw_wpadmin]<br>(C) Cporygiht Bboibng Wdie 2020, 2021. All rgiths rsereevd

source: Website designed and developed by&#xA0;<a href="https://herbmiller.me/">Herb Miller</a>&#xA0;<a href="https://www.twitter.com/herb_miller"></a>&#13; <br><a href="https://www.wordpress.org/">Proudly powered by WordPress</a>&#xA0;and&#xA0;<a href="https://oik-plugins.com/">oik plugins</a>
bb_bb: Wbeiste dsegiend And dvelepoed by&#xA0;<a href="https://herbmiller.me/">Herb Miller</a>&#xA0;<a href="https://www.twitter.com/herb_miller"></a>&#13; <br><a href="https://www.wordpress.org/">Proudly pworeed by WordPress</a>&#xA0;and&#xA0;<a href="https://oik-plugins.com/">oik plugins</a>

source: Blocks
bb_bb: Bolkcs

source: Plugins
bb_bb: Puligns

source: Themes
bb_bb: Tehems

source: Block news
bb_bb: Bolck nwes

source: About
bb_bb: Aobut

source: home-part.html is part of home.html
bb_bb: hmoe-prat.hmtl Is prat Of hmoe.hmtl

source: Testing translation of rich text strings. <code><a href="https://github.com/bobbingwide/oik-i18n">oik-i18n</a></code>'s routines will extract the <strong>rich text</strong> strings for translation, these are automatically translated into UK English ( <code>en_GB</code> ) and the <em>obfuscated</em> bbboing language ( bb_BB ), then the theme's files are <strong>localized</strong>.
bb_bb: Tseitng tarsnaliton Of rcih txet srtnigs. <code><a href="https://github.com/bobbingwide/oik-i18n">oik-i18n</a></code>'s ruoitens wlil etxarct thE <strong>rich text</strong> srtnigs fOr tarsnaliton, tehse ArE atumotacilaly tarsnaletd itno UK Egnilsh ( <code>en_GB</code> ) And thE <em>obfuscated</em> bbbiong lnauggae ( bb_BB ), tehn thE tehme's flies ArE <strong>localized</strong>.

source: Test creation -<strong> rich text</strong>
bb_bb: Tset certaoin -<strong> rcih text</strong>

source: Color check
bb_bb: Cloor cehck

source: sb-toolicons-block will help us find the blocks that support <strong>rich text</strong> strings.
bb_bb: sb-tooilocns-bolck wlil hlep Us fnid thE bolkcs taht spuoprt <strong>rich text</strong> srtnigs.

source: this includes List, Heading, Blockquote etc
bb_bb: tihs icnuleds Lsit, Haeidng, Bolkcuqtoe Etc

source: Will it translate this one?
bb_bb: Wlil It tarsnalte tihs OnE?

source: List
bb_bb: Lsit

source: Color
bb_bb: Cloor

source: Center
bb_bb: Cneetr

source: Check
bb_bb: Cehck

source: Internationalize
bb_bb: Itnreanitnolazie

source: Localize
bb_bb: Lcolazie

source: Aluminum
bb_bb: Aulimunm

source: Reversed bbboing
bb_bb: Rvereesd bbbiong

source: According to a researcher at Cambridge University, it doesn't matter in which order the letters in a word are, the only important thing is that the first and last letter be at the right place. The rest can be a total mess and you can still read it without problem. This is because the human mind does not read every letter by itself but the word as a whole.
bb_bb: Accroidng tO A rseaecrehr At Cmarbdige Uinevsrtiy, It deosn't mtaetr In wihch odrer thE lteetrs In A wrod ArE, thE olny ipmroatnt tihng Is taht thE frist And lsat lteetr bE At thE rgiht palce. ThE rset cAn bE A ttoal mses And yOU cAn sitll raed It wtiohut porlbem. Tihs Is bceuase thE hmuan mnid deos nOt raed eevry lteetr by istlef bUt thE wrod As A wohle.

source: Non translatable
bb_bb: NOn tarsnalatlbe

source: Content that should not be translated can be marked up with <code>translate="no"</code>.
bb_bb: Cnoetnt taht sohlud nOt bE tarsnaletd cAn bE mraekd Up wtih <code>translate="no"</code>.

source: Obfuscate text but leave it readable.
bb_bb: Ofbsuacte txet bUt laeve It raeadlbe.

source: Herb Miller, author of bbboing
bb_bb: Hreb Mlielr, atuohr Of bbbiong

source: Example, using the <code>core/html</code> block.
bb_bb: Eaxpmle, uisng thE <code>core/html</code> bolck.

source: Information
bb_bb: Ifnroamiton

source: Issue-27 test case.
bb_bb: Issue-27 tset csae.

source: Issue-30 test case.
bb_bb: Issue-30 tset csae.

source: Published: [bw_field post_date] | Last updated: [bw_field post_modified] [post-edit]
bb_bb: Pbuilhsed: [bw_field post_date] | Lsat udptaed: [bw_field post_modified] [post-edit]

source: Search
bb_bb: Saecrh
